**@author : Bienvenu Samuel**

**@group : B**

**@email : samuel.bienvenu@efrei.net**

# Librairies

In [ ]:
#installing the necessary librairies 
# pip install pandas numpy matplotlib seaborn

In [6]:
#Importing the necessary librairies
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Data loading

In [8]:
df=pd.read_csv('uber.csv', delimiter=",") #reading the csv file located in the same directory

In [9]:
df.head() #displaying the first 5 rows of the dataset

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [7]:
df.describe() #displaying the statistical summary of the dataset

                 Lat            Lon
count  564516.000000  564516.000000
mean       40.740005     -73.976817
std         0.036083       0.050426
min        40.072900     -74.773300
25%        40.722500     -73.997700
50%        40.742500     -73.984800
75%        40.760700     -73.970000
max        42.116600     -72.066600

In [10]:
df.info() #displaying the information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  object
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  object
dtypes: float64(2), object(2)
memory usage: 17.2+ MB

# Data transformation

In [12]:
df["Date/Time"]=df["Date/Time"].map(pd.to_datetime) #converting the Date/Time column to datetime format

In [13]:
df.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512

In [15]:
def get_dom(dt):
    return dt.day #extracting the day of the month from the Date/Time column

In [16]:
df["day"]=df["Date/Time"].map(get_dom) #creating a new column day in the dataset

In [17]:
def get_weekday(dt):
    return dt.weekday() #extracting the day of the week from the Date/Time column

In [18]:
df["weekday"]=df["Date/Time"].map(get_weekday) #creating a new column weekday in the dataset

In [20]:
df

                 Date/Time      Lat      Lon    Base  day  weekday
0      2014-04-01 00:11:00  40.7690 -73.9549  B02512    1        1
1      2014-04-01 00:17:00  40.7267 -74.0345  B02512    1        1
2      2014-04-01 00:21:00  40.7316 -73.9873  B02512    1        1
3      2014-04-01 00:28:00  40.7588 -73.9776  B02512    1        1
4      2014-04-01 00:33:00  40.7594 -73.9722  B02512    1        1
...                    ...      ...      ...     ...  ...      ...
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764   30        2
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764   30        2
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764   30        2
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764   30        2
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764   30        2

[564516 rows x 6 columns]

In [21]:
def get_hour(dt):
    return dt.hour #extracting the hour from the Date/Time column

In [22]:
df["hour"]=df["Date/Time"].map(get_hour) #creating a new column hour in the dataset

In [ ]:
df.info()

# Visual Representation

In [ ]:
#pip install pygwalker

In [ ]:
import pygwalker as pyg

In [ ]:
#uber=pyg.walk(df)
#to turn the pandas dataframe into a interactive UI for visual analysis

Box(children=(HTML(value='\n<div id="ifr-pyg-0006214b8ae410e3W5p9LxeMFw2V6K8N" style="height: auto">\n    <hea…

In [ ]:
df.